app/controllers/subcategories_controller.rb

	def index


		# @subcategories = Subcategory.where("category_name = '#{params[:name]}'")
		# @subcategories = Subcategory.all
		# @subcategories = Subcategory.find(params[:id])
		@subcategories = Subcategory.where("category_name = '#{params[:cname]}'")
---
SELECT  `subcategories`.* FROM `subcategories`  WHERE (category_name = food)  ORDER BY `subcategories`.`id` ASC LIMIT 1

	def show
		@subcategory = Subcategory.find(params[:id])
---
SELECT  `subcategories`.* FROM `subcategories`  WHERE `subcategories`.`id` = 1 LIMIT 1